Revit 2024 API
RepeaterCoordinates Class
 Represents coordinates in the array of repeating references in 0, 1, or 2 dimensions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class RepeaterCoordinates : IDisposable
Visual Basic
Public Class RepeaterCoordinates _
	Implements IDisposable
Visual C++
public ref class RepeaterCoordinates : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RepeaterCoordinates
See Also
RepeaterCoordinates Members
Autodesk.Revit.DB Namespace